ChibiOS/ChibiOS-Contrib/os/hal/ports/GD/GD32VF103/TIM/hal_icu_lld.h
#if !defined(GD32_HAS_TIM1)
#define GD32_HAS_TIM1                      FALSE
#endif

#if !defined(GD32_HAS_TIM2)
#define GD32_HAS_TIM2                      FALSE
#endif

#if !defined(GD32_HAS_TIM3)
#define GD32_HAS_TIM3                      FALSE
#endif

#if !defined(GD32_HAS_TIM4)
#define GD32_HAS_TIM4                      FALSE
#endif

#if !defined(GD32_HAS_TIM5)
#define GD32_HAS_TIM5                      FALSE
#endif

#if !defined(GD32_HAS_TIM8)
#define GD32_HAS_TIM8                      FALSE
#endif

#if !defined(GD32_HAS_TIM9)
#define GD32_HAS_TIM9                      FALSE
#endif

#if !defined(GD32_HAS_TIM10)
#define GD32_HAS_TIM10                     FALSE
#endif

#if !defined(GD32_HAS_TIM11)
#define GD32_HAS_TIM11                     FALSE
#endif

#if !defined(GD32_HAS_TIM12)
#define GD32_HAS_TIM12                     FALSE
#endif

#if !defined(GD32_HAS_TIM13)
#define GD32_HAS_TIM13                     FALSE
#endif

#if !defined(GD32_HAS_TIM14)
#define GD32_HAS_TIM14                     FALSE
#endif

#if !defined(GD32_HAS_TIM15)
#define GD32_HAS_TIM15                     FALSE
#endif

#if !defined(GD32_HAS_TIM20)
#define GD32_HAS_TIM20                     FALSE
#endif

#if !defined(GD32_HAS_TIM21)
#define GD32_HAS_TIM21                     FALSE
#endif

#if !defined(GD32_HAS_TIM22)
#define GD32_HAS_TIM22                     FALSE
#endif

#if GD32_ICU_USE_TIM1 && !GD32_HAS_TIM1
#error "TIM1 not present in the selected device"
#endif

#if GD32_ICU_USE_TIM2 && !GD32_HAS_TIM2
#error "TIM2 not present in the selected device"
#endif

#if GD32_ICU_USE_TIM3 && !GD32_HAS_TIM3
#error "TIM3 not present in the selected device"
#endif

#if GD32_ICU_USE_TIM4 && !GD32_HAS_TIM4
#error "TIM4 not present in the selected device"
#endif

#if GD32_ICU_USE_TIM5 && !GD32_HAS_TIM5
#error "TIM5 not present in the selected device"
#endif

#if GD32_ICU_USE_TIM8 && !GD32_HAS_TIM8
#error "TIM8 not present in the selected device"
#endif

#if GD32_ICU_USE_TIM9 && !GD32_HAS_TIM9
#error "TIM9 not present in the selected device"
#endif

#if GD32_ICU_USE_TIM10 && !GD32_HAS_TIM10
#error "TIM10 not present in the selected device"
#endif

#if GD32_ICU_USE_TIM11 && !GD32_HAS_TIM11
#error "TIM11 not present in the selected device"
#endif

#if GD32_ICU_USE_TIM12 && !GD32_HAS_TIM12
#error "TIM12 not present in the selected device"
#endif

#if GD32_ICU_USE_TIM13 && !GD32_HAS_TIM13
#error "TIM13 not present in the selected device"
#endif

#if GD32_ICU_USE_TIM14 && !GD32_HAS_TIM14
#error "TIM14 not present in the selected device"
#endif

#if GD32_ICU_USE_TIM15 && !GD32_HAS_TIM15
#error "TIM15 not present in the selected device"
#endif

#if GD32_ICU_USE_TIM20 && !GD32_HAS_TIM20
#error "TIM20 not present in the selected device"
#endif

#if GD32_ICU_USE_TIM21 && !GD32_HAS_TIM21
#error "TIM21 not present in the selected device"
#endif

#if GD32_ICU_USE_TIM22 && !GD32_HAS_TIM22
#error "TIM22 not present in the selected device"
#endif

#if !GD32_ICU_USE_TIM1  && !GD32_ICU_USE_TIM2  &&                         \
    !GD32_ICU_USE_TIM3  && !GD32_ICU_USE_TIM4  &&                         \
    !GD32_ICU_USE_TIM5  && !GD32_ICU_USE_TIM8  &&                         \
    !GD32_ICU_USE_TIM9  && !GD32_ICU_USE_TIM10 &&                         \
    !GD32_ICU_USE_TIM11 && !GD32_ICU_USE_TIM12 &&                         \
    !GD32_ICU_USE_TIM13 && !GD32_ICU_USE_TIM14 &&                         \
    !GD32_ICU_USE_TIM15 && !GD32_ICU_USE_TIM20 &&                         \
    !GD32_ICU_USE_TIM21 && !GD32_ICU_USE_TIM22
#error "ICU driver activated but no TIM peripheral assigned"
#endif

/* Checks on allocation of TIMx units.*/
#if GD32_ICU_USE_TIM1
#if defined(GD32_TIM1_IS_USED)
#error "ICUD1 requires TIM1 but the timer is already used"
#else
#define GD32_TIM1_IS_USED
#endif
#endif

#if GD32_ICU_USE_TIM2
#if defined(GD32_TIM2_IS_USED)
#error "ICUD2 requires TIM2 but the timer is already used"
#else
#define GD32_TIM2_IS_USED
#endif
#endif

#if GD32_ICU_USE_TIM3
#if defined(GD32_TIM3_IS_USED)
#error "ICUD3 requires TIM3 but the timer is already used"
#else
#define GD32_TIM3_IS_USED
#endif
#endif

#if GD32_ICU_USE_TIM4
#if defined(GD32_TIM4_IS_USED)
#error "ICUD4 requires TIM4 but the timer is already used"
#else
#define GD32_TIM4_IS_USED
#endif
#endif

#if GD32_ICU_USE_TIM5
#if defined(GD32_TIM5_IS_USED)
#error "ICUD5 requires TIM5 but the timer is already used"
#else
#define GD32_TIM5_IS_USED
#endif
#endif

#if GD32_ICU_USE_TIM8
#if defined(GD32_TIM8_IS_USED)
#error "ICUD8 requires TIM8 but the timer is already used"
#else
#define GD32_TIM8_IS_USED
#endif
#endif

#if GD32_ICU_USE_TIM9
#if defined(GD32_TIM9_IS_USED)
#error "ICUD9 requires TIM9 but the timer is already used"
#else
#define GD32_TIM9_IS_USED
#endif
#endif

#if GD32_ICU_USE_TIM10
#if defined(GD32_TIM10_IS_USED)
#error "ICUD10 requires TIM10 but the timer is already used"
#else
#define GD32_TIM10_IS_USED
#endif
#endif

#if GD32_ICU_USE_TIM11
#if defined(GD32_TIM11_IS_USED)
#error "ICUD11 requires TIM11 but the timer is already used"
#else
#define GD32_TIM11_IS_USED
#endif
#endif

#if GD32_ICU_USE_TIM12
#if defined(GD32_TIM12_IS_USED)
#error "ICUD12 requires TIM12 but the timer is already used"
#else
#define GD32_TIM12_IS_USED
#endif
#endif

#if GD32_ICU_USE_TIM13
#if defined(GD32_TIM13_IS_USED)
#error "ICUD13 requires TIM13 but the timer is already used"
#else
#define GD32_TIM13_IS_USED
#endif
#endif

#if GD32_ICU_USE_TIM14
#if defined(GD32_TIM14_IS_USED)
#error "ICUD14 requires TIM14 but the timer is already used"
#else
#define GD32_TIM14_IS_USED
#endif
#endif

#if GD32_ICU_USE_TIM15
#if defined(GD32_TIM15_IS_USED)
#error "ICUD15 requires TIM15 but the timer is already used"
#else
#define GD32_TIM15_IS_USED
#endif
#endif

#if GD32_ICU_USE_TIM20
#if defined(GD32_TIM20_IS_USED)
#error "ICUD20 requires TIM20 but the timer is already used"
#else
#define GD32_TIM20_IS_USED
#endif
#endif

#if GD32_ICU_USE_TIM21
#if defined(GD32_TIM21_IS_USED)
#error "ICUD21 requires TIM21 but the timer is already used"
#else
#define GD32_TIM21_IS_USED
#endif
#endif

#if GD32_ICU_USE_TIM22
#if defined(GD32_TIM22_IS_USED)
#error "ICUD22 requires TIM22 but the timer is already used"
#else
#define GD32_TIM22_IS_USED
#endif
#endif

/* IRQ priority checks.*/
#if GD32_ICU_USE_TIM1 && !defined(GD32_TIM1_SUPPRESS_ISR) &&              \
    !OSAL_IRQ_IS_VALID_PRIORITY(GD32_ICU_TIM1_IRQ_PRIORITY)
#error "Invalid IRQ priority assigned to TIM1"
#endif

#if GD32_ICU_USE_TIM2 && !defined(GD32_TIM2_SUPPRESS_ISR) &&              \
    !OSAL_IRQ_IS_VALID_PRIORITY(GD32_ICU_TIM2_IRQ_PRIORITY)
#error "Invalid IRQ priority assigned to TIM2"
#endif

